Documents/CRM_СобытияПоРабочимЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_СобытияПоРабочимЛистам</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершеноУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаВыдачу</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаТестДрайв</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаПродажуАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_СобытияПоРабочимЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛидПрикрепленный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтомобилиДляВыдачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_Договор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ВоронкаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ВоронкаПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_ОбластиПрименения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ОбластиПрименения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОФУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/CRM_СобытияПоРабочимЛистам/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//определение вида разрешения ("Создание","Просмотр","Редактирование") - редактирование проверим при записи
	ВидРазрешения=?(Объект.Ссылка.Пустая(),"Создание","Просмотр");
	
	Если Параметры.Свойство("Дата") Тогда Объект.Дата=Параметры.Дата КонецЕсли;
	Если Параметры.Свойство("ДатаЗакрытия") Тогда Объект.ДатаЗакрытия=Параметры.ДатаЗакрытия КонецЕсли;
	
	//для нового события может быть переданы разрешенныые облсти применения события
	Если Параметры.Свойство("ОбластиПрименения") Тогда ОбластиПрименения.ЗагрузитьЗначения(Параметры.ОбластиПрименения) КонецЕсли;
	
	//определение вида события
	Если Параметры.Свойство("ВидСобытия") Тогда Объект.ВидСобытия=Параметры.ВидСобытия 
	ИначеЕсли Объект.ВидСобытия.Пустая() Тогда //вид события из переданного списка ОбластиПрименения
		РазрешенныеВидыСобытий=Справочники.CRM_ВидыСобытий.РазрешенныеВидыСобытийПоОбластямПрименения(ОбластиПрименения.ВыгрузитьЗначения(),ВидРазрешения);
		Объект.ВидСобытия=?(РазрешенныеВидыСобытий.Найти(Справочники.CRM_ВидыСобытий.Прочее)<>Неопределено,Справочники.CRM_ВидыСобытий.Прочее,
			?(РазрешенныеВидыСобытий.Количество()>0,РазрешенныеВидыСобытий[0],"")
		)
	КонецЕсли;
	
	//Если Справочники.CRM_ВидыСобытий.РазрешенныеСобытия(ВидРазрешения).Найти(Объект.ВидСобытия)=Неопределено Тогда
	//	Отказ=Истина;
	//	Сообщить("Нет прав <"+ВидРазрешения+"> по виду события "+Объект.ВидСобытия,СтатусСообщения.Внимание);
	//КонецЕсли;
	
	//разрешение редактирования
	Если ВидРазрешения="Просмотр" И Объект.Автор<>ПараметрыСеанса.Пользователь И Объект.Сотрудник<>ПараметрыСеанса.Пользователь.Сотрудник
		И Справочники.CRM_ВидыСобытий.РазрешенныеСобытия("Редактирование").Найти(Объект.ВидСобытия)=Неопределено Тогда
		ТолькоПросмотр=Истина;
		Для Каждого Эл Из Элементы Цикл Попытка Эл.Доступность=Ложь Исключение КонецПопытки КонецЦикла;
	КонецЕсли;
	
	//ограничение вида события по области применения
	//Если Параметры.Свойство("ОбластьПрименения") Тогда
	//	Элементы.ВидСобытия.СписокВыбора.ЗагрузитьЗначения(Справочники.CRM_ВидыСобытий.РазрешенныеВидыСобытийПоОбластиПрименения(Параметры.ОбластьПрименения,ВидРазрешения));
	//КонецЕсли;
	
	//первоначальное заполнение
	Если Параметры.Свойство("IDK") Тогда Объект.IDK=Параметры.IDK КонецЕсли;	
	Если Параметры.Свойство("ВидСобытия") Тогда Объект.ВидСобытия=Параметры.ВидСобытия КонецЕсли;
	Если Параметры.Свойство("Сотрудник") Тогда Объект.Сотрудник=Параметры.Сотрудник КонецЕсли;
	Если Параметры.Свойство("ДилерскийЦентр") Тогда Объект.ДилерскийЦентр=Параметры.ДилерскийЦентр КонецЕсли;
	Если Параметры.Свойство("Подразделение") Тогда Объект.Подразделение=Параметры.Подразделение КонецЕсли;
	Если Параметры.Свойство("Отдел") Тогда Объект.Отдел=Параметры.Отдел КонецЕсли;

	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор=ПараметрыСеанса.Пользователь;
		Права=Renault_ОбщиеФункции.ПраваПользователя(ПараметрыСеанса.Пользователь);
		
		Если Объект.Сотрудник.Пустая() Тогда Объект.Сотрудник=ПараметрыСеанса.Пользователь.Сотрудник КонецЕсли;
		Если Объект.Отдел.Пустая() Тогда Объект.Отдел=Права.Отдел КонецЕсли;
		Если Объект.Подразделение.Пустая() Тогда Объект.Подразделение=Объект.Сотрудник.Подразделение КонецЕсли;
		Если Объект.ДилерскийЦентр.Пустая() Тогда Объект.ДилерскийЦентр=Права.ДилерскийЦентр КонецЕсли;
	КонецЕсли;	
	
	Если НЕ Объект.Сотрудник.Пустая() Тогда Адресация=4
	ИначеЕсли НЕ Объект.Отдел.Пустая() Тогда Адресация=3
	ИначеЕсли НЕ Объект.Подразделение.Пустая() Тогда Адресация=2
	Иначе Адресация=1
	КонецЕсли;	
	
	ОбновитьРасписание(); //@++

	УправлениеЭлементами();
	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Адресация<2 Тогда
		Объект.Подразделение="";
		Объект.Отдел="";
		Объект.Сотрудник="";
	ИначеЕсли Адресация<3 Тогда
		Объект.Отдел="";
		Объект.Сотрудник="";
	ИначеЕсли Адресация<4 Тогда
		Объект.Сотрудник="";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) 
	
	Оповестить("ОбновитьСобытия");
	
	Если Объект.ВидСобытия = Справочники.CRM_ВидыСобытий.Оплата Тогда
	
		ФормироватьЗадачуОЗаписиНаДиагностикуПриЗаписиНаОплату = ПолучитьСлужНастрокуФормированияЗадачиОДиагностике();
		
		Если ФормироватьЗадачуОЗаписиНаДиагностикуПриЗаписиНаОплату И ЗначениеЗаполнено(Объект.ДоговорНаПродажуАвтомобиля) Тогда
					
			Для Каждого Стр Из Объект.ДоговорНаПродажуАвтомобиля.СоставДоговора Цикл
				Если ЗначениеЗаполнено(Стр.ЗаявкаНаТрейдИн) Тогда		
					Если Вопрос("Создать задачу о записи клиента на диагностику?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
						СоздатьЗадачуОЗаписиКлиентаНаДиагностику(Объект.Ссылка);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
					
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //обновление календаря

&НаСервереБезКонтекста
Функция ПолучитьСлужНастрокуФормированияЗадачиОДиагностике()
	 Возврат Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование].ФормироватьЗадачуОЗаписиНаДиагностикуПриЗаписиНаОплату;
 КонецФункции
 
&НаСервереБезКонтекста
Процедура СоздатьЗадачуОЗаписиКлиентаНаДиагностику(Ссылка)

	Документы.CRM_СобытияПоРабочимЛистам.СоздатьЗадачуОЗаписиКлиентаНаДиагностику(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если Объект.АвторЗакрытия.Пустая() Тогда
		Объект.АвторЗакрытия=ПараметрыСеанса.Пользователь.Сотрудник;
	КонецЕсли;
	Объект.ДатаЗакрытия=Макс(Объект.Дата+5*60,ТекущаяДата());
	Объект.Длительность=(Объект.Дата-Объект.ДатаЗакрытия)/60;
КонецПроцедуры

Процедура УправлениеЭлементами()
	//Элементы.ЗаголовокФормы.Заголовок=""+Объект.ВидСобытия+" ("+Нрег(Объект.Состояние)+") "+?(Объект.Выполнена,"выполнена","не выполнена");
	//Заголовок=""+Объект.ВидСобытия+" ("+Нрег(Объект.Состояние)+") "+?(Объект.Выполнена,"выполнена","не выполнена");
	//Элементы.кнСостояниеЗадачи.Заголовок="Состояние:"+Символы.ПС+Объект.Состояние;
	//Элементы.кнВыполнить.Заголовок=?(Объект.Выполнена,"Отменить"+Символы.ПС+"выполнение","Выполнить");
	Элементы.кнВидСобытия.Заголовок="Вид события:"+Символы.ПС+Объект.ВидСобытия.Наименование;
	//Элементы.грЗакрытие.Видимость=Объект.Выполнена; 
	
	//Элементы.Длительность.Видимость=Объект.Ссылка.Пустая();
	Элементы.грЗакрытие.Видимость=НЕ Объект.Ссылка.Пустая();
	
	Элементы.Подразделение.Доступность=Адресация>1;
	Элементы.Отдел.Доступность=Адресация>2;
	Элементы.Сотрудник.Доступность=Адресация>3;
	
	Элементы.АвтомобилиДляВыдачи.Видимость=Объект.ВидСобытия=Справочники.CRM_ВидыСобытий.ТестДрайв;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЦветФона=Обработки.Renault_ДиалогВыбораЦвета.ЦветИзСтроки(Объект.ЦветФона);
	ЦветТекста=Обработки.Renault_ДиалогВыбораЦвета.ЦветИзСтроки(Объект.ЦветТекста);
	
	//Если Не Объект.Исполнитель.Пустая() И ПараметрыСеанса.Пользователь<>Объект.Исполнитель Тогда
	//	ТолькоПросмотр=Истина;
	//	Элементы.кнВыполнить.Доступность=Ложь;
	//	Элементы.кнПринятьКИсполнению.Доступность=Ложь;
	//	Элементы.кнОтменитьПринятиеКИсполнению.Доступность=Ложь;
	//	Элементы.кнСостояниеЗадачи.Доступность=Ложь;
	//	Сообщить("Вы не являетесь исполнителем, редактирование не доступно",СтатусСообщения.Информация);
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	//ОткрытьФорму("Обработка.Renault_ДиалогВыбораЦвета.Форма",Новый Структура("ТекущийЦвет",ЭтаФорма[Элемент.Имя]),ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения("ВыборЦвета",ЭтаФорма,Элемент.Имя));
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		Сообщить("Функционал не доступен",СтатусСообщения.Информация);
	Иначе
		Выполнить("ОткрытьФорму(""Обработка.Renault_ДиалогВыбораЦвета.Форма"",Новый Структура(""ТекущийЦвет"",ЭтаФорма[Элемент.Имя]),ЭтаФорма,УникальныйИдентификатор,,,Новый ОписаниеОповещения(""ВыборЦвета"",ЭтаФорма,Элемент.Имя))")
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЦвета(Цвет,ИмяЭлемента) Экспорт 
	Если Цвет=Неопределено Тогда Возврат КонецЕсли;
	ЭтаФорма[ИмяЭлемента]=Цвет;
	Объект[ИмяЭлемента]=Обработки.Renault_ДиалогВыбораЦвета.ЦветВСтроку(Цвет);
	Модифицированность=Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ЦветОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ЭтаФорма[Элемент.Имя]=Новый Цвет();
	Объект[Элемент.Имя]="";
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресацияПриИзменении(Элемент) УправлениеЭлементами() КонецПроцедуры

&НаКлиенте
Процедура ОбъектНажатие(Элемент, СтандартнаяОбработка)
	//СтрМД=Renault_ПередачаДанныхВСторонниеСистемы.СсылкаВМетаданныеСтрокой(Объект.Предмет);
	//ОткрытьФорму(СтрМД+".ФормаОбъекта",Новый Структура("Ключ",Объект.Предмет),ЭтаФорма);
	ОткрытьЗначение(Объект.Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаСобытия(Команда="")
	//Виды событий по правам
	Если ОбластиПрименения.Количество()=0 Тогда 
		ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Общие);
		ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Продажи);
		//ОбластиПрименения.Добавить(Перечисления.Renault_ОбластиПрименения.Сервис);
	КонецЕсли;
	ВидыСобытий=Справочники.CRM_ВидыСобытий.СписокВидовСобытий(Справочники.CRM_ВидыСобытий.РазрешенныеВидыСобытийПоОбластямПрименения(ОбластиПрименения.ВыгрузитьЗначения(),"Создание"),Объект.ВидСобытия);
	Парам=Новый Структура;
	Парам.Вставить("Список",ВидыСобытий);
	Парам.Вставить("Заголовок","Выбор вида события");
	Парам.Вставить("МножественныйВыбор",Ложь);
	//Парам.Вставить("КоличествоЭлементовВСтроке",4);
	Парам.Вставить("ШиринаЭлемента",17);
	Парам.Вставить("ВысотаЭлемента",2);
	ВидСобытия=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
	Если ВидСобытия<>Неопределено Тогда 
		Объект.ВидСобытия=ВидСобытия;
		//УстановитьНаименованиеЗадачи(ВидСобытия);
		Модифицированность=Истина;
	КонецЕсли;
	УправлениеЭлементами();
КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеЗадачи(ВидСобытия)
	
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.CRM_СобытияПоРабочимЛистам"));
	Задачи.Renault_События.УстановитьНаименованиеЗадачи(ЭтотОбъект, ВидСобытия);
	ЗначениеВДанныеФормы(ЭтотОбъект, Объект);

КонецПроцедуры

&НаСервере
Процедура ОбновитьРасписание()
	
	ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("Сотрудник", Объект.Сотрудник);
//	ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("Автомобиль", ТестДрайв_Автомобиль);
	ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ДилерскийЦентр", Объект.ДилерскийЦентр);
	ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(Объект.ДатаНапоминания));
	ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецДня(Объект.ДатаНапоминания));
	
	Если Объект.ВидСобытия = Справочники.CRM_ВидыСобытий.ТестДрайв Тогда
		ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ПоказыватьТестДрайв", Истина);
		ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыдачу", Ложь);
	ИначеЕсли Объект.ВидСобытия = Справочники.CRM_ВидыСобытий.Выдача Тогда
		ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ПоказыватьТестДрайв", Ложь);
		ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыдачу", Истина);
	Иначе
		ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ПоказыватьТестДрайв", Ложь);
		ТаблоРасписание.Параметры.УстановитьЗначениеПараметра("ПоказыватьВыдачу", Ложь);
	КонецЕсли;
	
	//Выборка = Запрос.Выполнить().Выбрать();	
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	//Тест или выдачу выделяем желтым
	//	Если Выборка.Тип = 2 ИЛИ Выборка.Тип = 3 Тогда
	//		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗапись");
	//	Иначе
	//		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	//	КонецЕсли;
	//	
	//	Если СтрДлина(СокрЛП(Формат(Выборка.ДатаНапоминания ,"ДЛФ=T")))= 8 Тогда
	//		ОбластьМакета.Параметры.Время  = Лев(СокрЛП(Формат(Выборка.ДатаНапоминания, "ДЛФ=T")),5);
	//	Иначе
	//		ОбластьМакета.Параметры.Время  = Лев(СокрЛП(Формат(Выборка.ДатаНапоминания, "ДЛФ=T")),4);
	//	КонецЕсли;
	//	
	//	ОбластьМакета.Параметры.Комментарий  = СокрЛП(Выборка.Комментарий);		
	//
	//	//Если (Не СокрЛП(Время)="") и (Дата(Лев(ЭлементыФормы.ПолеКалендаря.ТекущаяДата,10)+" "+СокрЛП(Время)+":00")+(15*60)>Выборка.ДатаНапоминания) и (Дата(Лев(ЭлементыФормы.ПолеКалендаря.ТекущаяДата,10)+" "+СокрЛП(Время)+":00")-(15*60)<Выборка.ДатаНапоминания) Тогда
	//	//	ТекущаяОбласть = ОбластьМакета.ТекущаяОбласть;
	//	//	ТекОбласть  = ОбластьМакета.Область(ТекущаяОбласть.Верх, 2, ТекущаяОбласть.Низ, 2);
	//	//	ТекОбласть.ЦветФона = WebЦвета.Томатный;
	//	//КонецЕсли;			
	//	
	//	Таб.Вывести(ОбластьМакета);
	//	
	//КонецЦикла;
	//
	//Таб.ЗакончитьАвтогруппировкуСтрок();
	//Таб.ОтображатьЗаголовки = Ложь;
	//Таб.ОтображатьСетку     = Ложь;
	//Таб.ТолькоПросмотр      = Истина;
	//ТабличныйДокумент.Вывести(Таб);
	//ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	////ТабличныйДокумент.ФиксацияСверху      = 3;
	//ТабличныйДокумент.ОтображатьСетку     = Ложь;
	//ТабличныйДокумент.ТолькоПросмотр      = Истина;
	//ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	//ТабличныйДокумент.АвтоМасштаб         = Истина;		
	//ТабличныйДокумент.ТекущаяОбласть.Верх =1;
	//ТабличныйДокумент.ТекущаяОбласть.Лево =1;
	//ТабличныйДокумент.ТекущаяОбласть.Право=1;
	//ТабличныйДокумент.ТекущаяОбласть.Низ  =1;
	//ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1, 1, 1);
		
КонецПроцедуры

//&НаКлиенте
//Процедура кнСостояниеЗадачи(Команда)
//	Сп=Новый СписокЗначений;
//	Запрос=Новый Запрос("Выбрать Ссылка Из Справочник.Renault_Состояния Где НЕ ПометкаУдаления");
//	Для Каждого Эл Из Запрос.Выполнить().Выгрузить() Цикл Сп.Добавить(Эл.Ссылка,""+Эл.Ссылка,?(Объект.Состояние=Эл.Ссылка,Истина,Ложь)) КонецЦикла;
//	Парам=Новый Структура;
//	Парам.Вставить("Список",Сп);
//	Парам.Вставить("Заголовок","Состояние задачи");
//	Парам.Вставить("МножественныйВыбор",Ложь);
//	//Парам.Вставить("КоличествоЭлементовВСтроке",5);
//	Парам.Вставить("ШиринаЭлемента",14);
//	Парам.Вставить("ВысотаЭлемента",2);
//	Состояние=ОткрытьФормуМодально("ОбщаяФорма.Renault_ДиалогВыбораСпискаЗначений",Парам,ЭтаФорма);
//	Если Состояние<>Неопределено Тогда Объект.Состояние=Состояние; Модифицированность=Истина; КонецЕсли;
//	Элементы.кнСостояниеЗадачи.Заголовок=""+Объект.Состояние;
//КонецПроцедуры

//&НаКлиенте
//Процедура кнПринятьКИсполнению(Команда) ПринятьКИсполнению() КонецПроцедуры
//Процедура ПринятьКИсполнению() 
//	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
//	Если Задачи.Renault_События.ПринятьКИсполнению(ЭтотОбъект,ПараметрыСеанса.Пользователь) Тогда
//		ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
//		//Если НЕ Объект.Сотрудник.Пустая() Тогда Адресация=4 КонецЕсли;
//		УправлениеЭлементами();
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура кнОтменитьПринятиеКИсполнению(Команда) ОтменитьПринятиеКИсполнению() КонецПроцедуры
//Процедура ОтменитьПринятиеКИсполнению()
//	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
//	Если Задачи.Renault_События.ОтменитьПринятиеКИсполнению(ЭтотОбъект,ПараметрыСеанса.Пользователь) Тогда
//		ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
//		УправлениеЭлементами();
//	КонецЕсли;	
//КонецПроцедуры

//&НаКлиенте
//Процедура кнВыполнитьОтменитьВыполнение(Команда) 
//	Если Объект.Ссылка.Пустая() Тогда Сообщить("Задача не записана",СтатусСообщения.Внимание); Возврат КонецЕсли;
//	Если НЕ ВыполнитьОтменитьВыполнение() Тогда //если цель задачи не достигнута открываем объект задачи для выполнения
//		Задачи.Renault_События.СоздатьОткрытьЦельЗадачи(Объект.Ссылка)
//	Иначе Закрыть() КонецЕсли;
//КонецПроцедуры
//Функция ВыполнитьОтменитьВыполнение()
//	ЭтотОбъект=РеквизитФормыВЗначение("Объект");
//	Если Объект.Выполнена Тогда Результат=Задачи.Renault_События.ОтменитьВыполнениеЗадачи(ЭтотОбъект)
//	Иначе Результат=Задачи.Renault_События.ВыполнитьЗадачу(Объект.Ссылка,ПараметрыСеанса.Пользователь)
//	КонецЕсли;
//	Возврат Результат
//	//Если Результат Тогда 
//	//	ЗначениеВРеквизитФормы(ЭтотОбъект,"Объект");
//	//	УправлениеЭлементами();
//	//КонецЕсли;
//КонецФункции

&НаКлиенте
Процедура ОбъектЗадачиОткрытие(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Объект.Объект)=Тип("ДокументСсылка.CRM_КоммерческоеПредложение") Тогда
		СтандартнаяОбработка=Ложь;
		КП=Объект.Объект;
		Документы.CRM_КоммерческоеПредложение.Открыть(КП.РабочийЛист,КП.Клиент,КП)
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция  ПолучитьРабочийЛистДляСобытия ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_РабочиеЛисты.ДатаID КАК Период,
	|	Renault_РабочиеЛисты.ID,
	|	Renault_РабочиеЛисты.IDK,
	|	Renault_РабочиеЛисты.Отдел,
	|	Renault_РабочиеЛисты.Подразделение,
	|	Renault_РабочиеЛисты.Важность,
	|	ВЫБОР
	|		КОГДА CRM_ВоронкаПродаж_Выдача.Объект ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Выдача,
	|	Renault_РабочиеЛисты.ЗапросНаЗакрытие,
	|	Renault_РабочиеЛисты.КомментарийЗакрытия,
	|	Renault_РабочиеЛисты.Комплектация,
	|	ВЫБОР
	|		КОГДА CRM_ВоронкаПродаж_Контракт.Объект ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Контракт,
	|	Renault_РабочиеЛисты.ЛистЗакрыт,
	|	Renault_РабочиеЛисты.МаркаАвтомобиля,
	|	Renault_РабочиеЛисты.МодельАвтомобиля,
	|	Renault_РабочиеЛисты.Клиент,
	|	Renault_РабочиеЛисты.ПричинаЗакрытия,
	|	Renault_РабочиеЛисты.Сотрудник,
	|	Renault_РабочиеЛисты.Цвет,
	|	Renault_РабочиеЛисты.ДатаID КАК ДатаСоздания,
	|	Renault_РабочиеЛисты.ПервичныйИнтересМодель,
	|	Renault_РабочиеЛисты.VINАвтомобилей,
	|	ПОДСТРОКА(Renault_РабочиеЛисты.Клиент.НаименованиеПолное, 0, 100) КАК ФИО,
	|	ПОДСТРОКА(ЕСТЬNULL(КонтактнаяИнформация_Телефон.Представление, """"), 0, 50) КАК Телефон,
	|	ПОДСТРОКА(ЕСТЬNULL(КонтактнаяИнформация_Почта.Представление, """"), 0, 50) КАК Почта
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж_Выдача
	|		ПО Renault_РабочиеЛисты.IDK = CRM_ВоронкаПродаж_Выдача.IDK
	|			И (CRM_ВоронкаПродаж_Выдача.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.ВыдачаАвтомобиля))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВоронкаПродаж КАК CRM_ВоронкаПродаж_Контракт
	|		ПО Renault_РабочиеЛисты.IDK = CRM_ВоронкаПродаж_Контракт.IDK
	|			И (CRM_ВоронкаПродаж_Контракт.ЭтапПродаж = ЗНАЧЕНИЕ(Справочник.CRM_ЭтапыПродаж.Контракт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_Телефон
	|		ПО Renault_РабочиеЛисты.Клиент = КонтактнаяИнформация_Телефон.Объект
	|			И (КонтактнаяИнформация_Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформация_Телефон.ЗначениеПоУмолчанию = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_Почта
	|		ПО (КонтактнаяИнформация_Почта.ЗначениеПоУмолчанию = ИСТИНА)
	|			И Renault_РабочиеЛисты.Клиент = КонтактнаяИнформация_Почта.Объект
	|			И (КонтактнаяИнформация_Почта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|ГДЕ
	|	ИСТИНА
	|	И Renault_РабочиеЛисты.ЛистЗакрыт = ЛОЖЬ
	|	И Renault_РабочиеЛисты.ЗапросНаЗакрытие = ЛОЖЬ
	|	И Renault_РабочиеЛисты.Сотрудник = &ОтборМенеджер
	|УПОРЯДОЧИТЬ ПО
	|	Renault_РабочиеЛисты.Важность УБЫВ,
	|	Renault_РабочиеЛисты.ДатаID УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ОтборМенеджер",ПараметрыСеанса.Пользователь.Сотрудник);
	СписокВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		СписокВыбора.Добавить(Выборка.IDK,""+Выборка.IDK+"-"+Выборка.ФИО);
	КонецЦикла;
	Возврат СписокВыбора;
КонецФункции


&НаКлиенте
Процедура кнВыбратьРабочийЛист(Команда)
	ВыборИзСписка=Обработки.Renault_ARM_Менеджеры.ПолучитьФорму("ФормаВыбораИзСписка");
	ВыборИзСписка.Список=ПолучитьРабочийЛистДляСобытия();
	ВыборИзСписка.Заголовок="Выберите рабочий лист для создания события";
	Объект.IDK=ВыборИзСписка.ОткрытьМодально();
КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
//	Если Объект.Состояние.Пустая() Тогда
//		Если Вопрос("Не установлено состояние задачи. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда 
//			СтандартнаяОбработка=Ложь;
//			Отказ=Истина;
//			Возврат
//		КонецЕсли;	
//	КонецЕсли;	
//КонецПроцедуры
